emacs.d/configuration.org
#+TITLE: ylu's emacs configuration
#+AUTHOR: Yufan Lu


* Setup package and use-package

#+begin_src emacs-lisp
  (require 'package)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
  ;; (add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t)
  ;; (add-to-list 'package-archives '("gnu" . "https://elpa.gnu.org/packages/") t)
  (package-refresh-contents)
  (package-initialize)
#+end_src


#+begin_src emacs-lisp
  ;; (require 'use-package-ensure)
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (setq use-package-always-ensure t)
#+end_src

* Evil mode

#+begin_src emacs-lisp
  (use-package evil
    :init      ;; tweak evil's configuration before loading it
    (setq evil-want-integration t) ;; This is optional since it's already set to t by default.
    (setq evil-want-keybinding nil)
    (setq evil-vsplit-window-right t)
    (setq evil-split-window-below t)
    (evil-mode))

  (use-package evil-collection
    :after evil
    :config
    (setq evil-collection-mode-list '(dashboard dired ibuffer))
    (evil-collection-init))
#+end_src


* UI and Theme

#+begin_src emacs-lisp
  (use-package doom-themes)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
	  doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (load-theme 'doom-one t)

  (use-package doom-modeline)
  (doom-modeline-mode t)
#+end_src


#+begin_src emacs-lisp
  (menu-bar-mode -1)
  (tool-bar-mode -1)

  (scroll-bar-mode -1)
  (global-display-line-numbers-mode 1)
  (global-visual-line-mode t)
#+end_src
